Repository: gerege-systems/petronet-gerege-nexus
Catalog: native-apps/desktop/windows/src/PetroNetDesktop.Client/Strings/*/Resources.resw
Source language: en_us
Languages: ar_sa, es_es, fr_fr, mn_mn, ru_ru, zh_cn

# Login_Error_Backend
source: Backend unreachable. Start the server and try again.
ar_sa: الخادم غير متاح. شغّل الخادم وأعد المحاولة.
es_es: Servidor inaccesible. Inicie el servidor e inténtelo de nuevo.
fr_fr: Serveur injoignable. Démarrez le serveur et réessayez.
mn_mn: Backend холболтгүй байна. Серверийг асаагаад дахин оролдоно уу.
ru_ru: Сервер недоступен. Запустите сервер и повторите попытку.
zh_cn: 无法连接后端。请启动服务器后重试。

# Login_Error_EndpointMissing
source: This server endpoint is not yet active. Try the "QR code" tab instead.
ar_sa: منفذ الخادم هذا غير مفعّل بعد. استخدم تبويب «رمز QR» بدلاً منه.
es_es: Este endpoint del servidor aún no está activo. Use la pestaña «Código QR».
fr_fr: Ce point d'accès du serveur n'est pas encore actif. Utilisez plutôt l'onglet « Code QR ».
mn_mn: Серверийн энэ endpoint хараахан идэвхгүй байна. "QR код"-аар нэвтрэхийг оролдоно уу.
ru_ru: Этот эндпойнт сервера ещё не активен. Попробуйте вкладку «QR-код».
zh_cn: 该服务器接口尚未启用，请改用“二维码”选项卡。

# Login_Tab_NationalId
source: National ID
ar_sa: الهوية الوطنية
es_es: Documento nacional
fr_fr: Numéro national
mn_mn: Регистрийн дугаар
ru_ru: Регистрационный номер
zh_cn: 登记号

# Login_Tab_Qr
source: QR code
ar_sa: رمز QR
es_es: Código QR
fr_fr: Code QR
mn_mn: QR код
ru_ru: QR-код
zh_cn: 二维码

# Login_Tab_Token
source: USB Token
ar_sa: مفتاح USB
es_es: Token USB
fr_fr: Token USB
mn_mn: USB Токен
ru_ru: USB-токен
zh_cn: USB 令牌

# Login_Qr_Hint
source: Scan this QR code with the e-ID Mongolia app.
ar_sa: امسح رمز QR هذا بتطبيق e-ID Mongolia.
es_es: Escanee este código QR con la aplicación e-ID Mongolia.
fr_fr: Scannez ce code QR avec l'application e-ID Mongolia.
mn_mn: e-ID Mongolia апп-аар уг QR кодыг уншуулна уу.
ru_ru: Отсканируйте этот QR-код приложением e-ID Mongolia.
zh_cn: 请使用 e-ID Mongolia 应用扫描此二维码。

# Login_Qr_Start
source: Generate QR
ar_sa: إنشاء رمز QR
es_es: Generar QR
fr_fr: Générer un QR
mn_mn: QR үүсгэх
ru_ru: Создать QR
zh_cn: 生成二维码

# Login_Result_NationalId
source: National ID
ar_sa: رقم الهوية الوطنية
es_es: Documento nacional de identidad
fr_fr: Numéro national d'identité
mn_mn: Регистрийн дугаар
ru_ru: Регистрационный номер
zh_cn: 登记号

# Login_Result_KycLevel
source: KYC level
ar_sa: مستوى KYC
es_es: Nivel KYC
fr_fr: Niveau KYC
mn_mn: KYC түвшин
ru_ru: Уровень KYC
zh_cn: KYC 等级

# Login_Token_Section
source: Detected tokens
ar_sa: المفاتيح المكتشفة
es_es: Tokens detectados
fr_fr: Tokens détectés
mn_mn: Холбогдсон токенууд
ru_ru: Обнаруженные токены
zh_cn: 已检测到的令牌

# Login_Token_Empty
source: No USB token found. Plug in your token and refresh.
ar_sa: لم يُعثر على مفتاح USB. وصّل مفتاحك ثم حدّث.
es_es: No se encontró ningún token USB. Conecte su token y actualice.
fr_fr: Aucun token USB détecté. Branchez votre token et actualisez.
mn_mn: Токен олдсонгүй. USB токеноо залгаад дахин шалгана уу.
ru_ru: USB-токен не найден. Подключите токен и обновите список.
zh_cn: 未找到 USB 令牌。请插入令牌后刷新。

# Login_Token_Scan
source: Refresh
ar_sa: تحديث
es_es: Actualizar
fr_fr: Actualiser
mn_mn: Шинэчлэх
ru_ru: Обновить
zh_cn: 刷新

# Login_Token_Pin
source: Token PIN
ar_sa: رمز PIN للمفتاح
es_es: PIN del token
fr_fr: PIN du token
mn_mn: Токений PIN
ru_ru: PIN токена
zh_cn: 令牌 PIN

# Login_Token_PinPlaceholder
source: Enter your PIN
ar_sa: أدخل رمز PIN
es_es: Introduzca su PIN
fr_fr: Saisissez votre PIN
mn_mn: PIN-ээ оруулна уу
ru_ru: Введите PIN
zh_cn: 请输入 PIN

# Login_Token_SignIn
source: Sign in with token
ar_sa: تسجيل الدخول بالمفتاح
es_es: Iniciar sesión con el token
fr_fr: Se connecter avec le token
mn_mn: Токеноор нэвтрэх
ru_ru: Войти с помощью токена
zh_cn: 使用令牌登录

# Login_Token_Status_Opening
source: Opening session with the token...
ar_sa: جارٍ فتح جلسة مع المفتاح…
es_es: Abriendo sesión con el token…
fr_fr: Ouverture de la session avec le token…
mn_mn: Токентэй холбогдож байна...
ru_ru: Открытие сессии с токеном...
zh_cn: 正在与令牌建立会话...

# Login_Token_Status_Reading
source: Reading certificate from the token...
ar_sa: جارٍ قراءة الشهادة من المفتاح…
es_es: Leyendo el certificado del token…
fr_fr: Lecture du certificat depuis le token…
mn_mn: Токений сертификатыг уншиж байна...
ru_ru: Чтение сертификата с токена...
zh_cn: 正在从令牌读取证书...

# Login_Token_Status_Challenge
source: Requesting challenge from the server...
ar_sa: جارٍ طلب التحدي من الخادم…
es_es: Solicitando el desafío al servidor…
fr_fr: Demande du défi au serveur…
mn_mn: Серверээс баталгаажуулалт авч байна...
ru_ru: Запрос challenge у сервера...
zh_cn: 正在向服务器请求挑战码...

# Login_Token_Status_Signing
source: Signing... (Windows may show a PIN dialog)
ar_sa: جارٍ التوقيع… (قد يعرض Windows نافذة PIN)
es_es: Firmando… (Windows puede mostrar un diálogo de PIN)
fr_fr: Signature… (Windows peut afficher une fenêtre de PIN)
mn_mn: Гарын үсэг зурж байна... (Windows PIN цонх гарч ирж магадгүй)
ru_ru: Подписание... (Windows может показать диалог PIN)
zh_cn: 正在签名...（Windows 可能弹出 PIN 对话框）

# Login_Token_Status_Verifying
source: Server is verifying the signature...
ar_sa: الخادم يتحقق من التوقيع…
es_es: El servidor está verificando la firma…
fr_fr: Le serveur vérifie la signature…
mn_mn: Сервер баталгаажуулж байна...
ru_ru: Сервер проверяет подпись...
zh_cn: 服务器正在校验签名...

# Login_Token_Error_NoKeyOrCert
source: This token has no signing key or certificate available.
ar_sa: لا يحتوي هذا المفتاح على مفتاح توقيع أو شهادة متاحة.
es_es: Este token no tiene clave de firma ni certificado disponibles.
fr_fr: Ce token n'a ni clé de signature ni certificat disponible.
mn_mn: Энэ токен дээр гарын үсэг зурах түлхүүр болон сертификат олдсонгүй.
ru_ru: На этом токене нет доступного ключа подписи или сертификата.
zh_cn: 该令牌上没有可用的签名密钥或证书。

# Dashboard_Title
source: Dashboard
ar_sa: لوحة التحكم
es_es: Panel
fr_fr: Tableau de bord
mn_mn: Хяналтын самбар
ru_ru: Панель
zh_cn: 控制台

# Dashboard_Subtitle
source: Your e-ID information dashboard.
ar_sa: لوحة معلومات هويتك الإلكترونية.
es_es: Su panel de información de e-ID.
fr_fr: Le tableau de bord de vos informations e-ID.
mn_mn: Таны цахим иргэний мэдээллийн хяналтын самбар.
ru_ru: Обзор данных вашего e-ID.
zh_cn: 您的 e-ID 信息概览。

# Dashboard_Greeting
source: Welcome,
ar_sa: أهلاً بك،
es_es: Bienvenido,
fr_fr: Bienvenue,
mn_mn: Сайн байна уу,
ru_ru: Добро пожаловать,
zh_cn: 欢迎，

# Dashboard_StatusBadge
source: System Operational
ar_sa: النظام يعمل
es_es: Sistema operativo
fr_fr: Système opérationnel
mn_mn: Систем хэвийн ажиллаж байна
ru_ru: Система работает
zh_cn: 系统运行正常

# Dashboard_Stats_SecurityScore
source: Security Score
ar_sa: درجة الأمان
es_es: Puntuación de seguridad
fr_fr: Score de sécurité
mn_mn: Аюулгүй байдлын оноо
ru_ru: Оценка безопасности
zh_cn: 安全评分

# Dashboard_Stats_Certificates
source: Verified Assets
ar_sa: العناصر المُتحقَّق منها
es_es: Elementos verificados
fr_fr: Éléments vérifiés
mn_mn: Баталгаажсан хөрөнгө
ru_ru: Проверенные активы
zh_cn: 已验证资产

# Dashboard_Stats_Logins
source: Total Logins
ar_sa: إجمالي مرات الدخول
es_es: Inicios de sesión totales
fr_fr: Connexions totales
mn_mn: Нийт нэвтрэлт
ru_ru: Всего входов
zh_cn: 登录总次数

# Dashboard_Stats_LastLogin
source: Last Login
ar_sa: آخر تسجيل دخول
es_es: Último inicio de sesión
fr_fr: Dernière connexion
mn_mn: Сүүлийн нэвтрэлт
ru_ru: Последний вход
zh_cn: 最近登录

# Dashboard_Devices_Section
source: Trusted Devices
ar_sa: الأجهزة الموثوقة
es_es: Dispositivos de confianza
fr_fr: Appareils de confiance
mn_mn: Итгэмжлэгдсэн төхөөрөмж
ru_ru: Доверенные устройства
zh_cn: 受信任设备

# Dashboard_Devices_Empty
source: No registered devices yet.
ar_sa: لا توجد أجهزة مسجَّلة بعد.
es_es: Todavía no hay dispositivos registrados.
fr_fr: Aucun appareil enregistré pour le moment.
mn_mn: Бүртгэлтэй төхөөрөмж байхгүй байна.
ru_ru: Пока нет зарегистрированных устройств.
zh_cn: 尚无已注册的设备。

# Dashboard_Device_Active
source: Active
ar_sa: نشط
es_es: Activo
fr_fr: Actif
mn_mn: Идэвхтэй
ru_ru: Активно
zh_cn: 在用

# Dashboard_Device_Inactive
source: Inactive
ar_sa: غير نشط
es_es: Inactivo
fr_fr: Inactif
mn_mn: Идэвхгүй
ru_ru: Неактивно
zh_cn: 未在用

# Dashboard_Activity_Section
source: Audit Log
ar_sa: سجل التدقيق
es_es: Registro de auditoría
fr_fr: Journal d'audit
mn_mn: Үйл явцын түүх
ru_ru: Журнал аудита
zh_cn: 审计日志

# Dashboard_Activity_Empty
source: Activity history is empty.
ar_sa: سجل النشاط فارغ.
es_es: El historial de actividad está vacío.
fr_fr: L'historique d'activité est vide.
mn_mn: Үйл ажиллагааны түүх хоосон.
ru_ru: История активности пуста.
zh_cn: 活动记录为空。

# Dashboard_Activity_Auth
source: Login
ar_sa: تسجيل دخول
es_es: Inicio de sesión
fr_fr: Connexion
mn_mn: Нэвтрэлт
ru_ru: Вход
zh_cn: 登录

# Dashboard_Activity_Sign
source: Sign
ar_sa: توقيع
es_es: Firma
fr_fr: Signature
mn_mn: Гарын үсэг
ru_ru: Подпись
zh_cn: 签名

# Dashboard_Activity_Success
source: Success
ar_sa: نجح
es_es: Correcto
fr_fr: Réussi
mn_mn: Амжилттай
ru_ru: Успешно
zh_cn: 成功

# Dashboard_Activity_Failure
source: Denied
ar_sa: مرفوض
es_es: Denegado
fr_fr: Refusé
mn_mn: Татгалзсан
ru_ru: Отклонено
zh_cn: 已拒绝

# Dashboard_Refresh
source: Refresh
ar_sa: تحديث
es_es: Actualizar
fr_fr: Actualiser
mn_mn: Шинэчлэх
ru_ru: Обновить
zh_cn: 刷新

# Dashboard_Loading
source: Loading...
ar_sa: جارٍ التحميل…
es_es: Cargando…
fr_fr: Chargement…
mn_mn: Уншиж байна...
ru_ru: Загрузка...
zh_cn: 加载中...

# Dashboard_Error_Generic
source: Failed to load dashboard.
ar_sa: تعذّر تحميل لوحة التحكم.
es_es: No se pudo cargar el panel.
fr_fr: Échec du chargement du tableau de bord.
mn_mn: Хяналтын самбар ачаалахад алдаа гарлаа.
ru_ru: Не удалось загрузить панель.
zh_cn: 控制台加载失败。

# Settings_Title
source: Settings
ar_sa: الإعدادات
es_es: Ajustes
fr_fr: Paramètres
mn_mn: Тохиргоо
ru_ru: Настройки
zh_cn: 设置

# Settings_Theme
source: Theme
ar_sa: السمة
es_es: Tema
fr_fr: Thème
mn_mn: Дизайны өнгө
ru_ru: Оформление
zh_cn: 主题

# Settings_Theme_System
source: System
ar_sa: النظام
es_es: Sistema
fr_fr: Système
mn_mn: Системийн
ru_ru: Системное
zh_cn: 跟随系统

# Settings_Theme_Light
source: Light
ar_sa: فاتح
es_es: Claro
fr_fr: Clair
mn_mn: Цайвар
ru_ru: Светлое
zh_cn: 浅色

# Settings_Theme_Dark
source: Dark
ar_sa: داكن
es_es: Oscuro
fr_fr: Sombre
mn_mn: Бараан
ru_ru: Тёмное
zh_cn: 深色

# Settings_Language
source: Language
ar_sa: اللغة
es_es: Idioma
fr_fr: Langue
mn_mn: Хэл
ru_ru: Язык
zh_cn: 语言

# Settings_Version
source: Version
ar_sa: الإصدار
es_es: Versión
mn_mn: Хувилбар
ru_ru: Версия
zh_cn: 版本

# Common_Back
source: Back
ar_sa: رجوع
es_es: Atrás
fr_fr: Retour
mn_mn: Буцах
ru_ru: Назад
zh_cn: 返回

# Common_Loading
source: Loading…
ar_sa: جارٍ التحميل…
es_es: Cargando…
fr_fr: Chargement…
mn_mn: Уншиж байна…
ru_ru: Загрузка…
zh_cn: 加载中…

# Common_Cancel
source: Cancel
ar_sa: إلغاء
es_es: Cancelar
fr_fr: Annuler
mn_mn: Цуцлах
ru_ru: Отмена
zh_cn: 取消

# Common_Save
source: Save
ar_sa: حفظ
es_es: Guardar
fr_fr: Enregistrer
mn_mn: Хадгалах
ru_ru: Сохранить
zh_cn: 保存

# Common_OK
source: OK
ar_sa: موافق
mn_mn: За
zh_cn: 好

# Settings_Tokens_Title
source: Crypto token (USB / Smart Card)
ar_sa: مفتاح تشفيري (USB / بطاقة ذكية)
es_es: Token criptográfico (USB / tarjeta inteligente)
fr_fr: Token cryptographique (USB / carte à puce)
mn_mn: Крипто токен (USB / Smart Card)
ru_ru: Криптотокен (USB / смарт-карта)
zh_cn: 加密令牌（USB / 智能卡）

# Settings_Tokens_Refresh
source: Scan
ar_sa: فحص
es_es: Escanear
fr_fr: Analyser
mn_mn: Сканнердах
ru_ru: Сканировать
zh_cn: 扫描

# Settings_Tokens_Empty
source: No connected tokens found.
ar_sa: لم يُعثر على مفاتيح متصلة.
es_es: No se encontraron tokens conectados.
fr_fr: Aucun token connecté.
mn_mn: Холбогдсон токен олдсонгүй.
ru_ru: Подключённые токены не найдены.
zh_cn: 未找到已连接的令牌。

# Settings_Tokens_Scanning
source: Scanning...
ar_sa: جارٍ الفحص…
es_es: Escaneando…
fr_fr: Analyse…
mn_mn: Сканнердаж байна...
ru_ru: Сканирование...
zh_cn: 扫描中...

# Settings_Tokens_Provider
source: Backend
ar_sa: الواجهة الخلفية
mn_mn: Бэкенд
ru_ru: Провайдер
zh_cn: 后端

# Settings_Token_NoProvider
source: No token backend active on this machine
ar_sa: لا توجد واجهة مفاتيح نشطة على هذا الجهاز
es_es: No hay backend de token activo en este equipo
fr_fr: Aucun backend de token actif sur cette machine
mn_mn: Энэ компьютер дээр идэвхтэй токены бэкэнд алга
ru_ru: На этом компьютере нет активного провайдера токенов
zh_cn: 本机没有可用的令牌后端

# Token_Detail_Title
source: Token details
ar_sa: تفاصيل المفتاح
es_es: Detalles del token
fr_fr: Détails du token
mn_mn: Токены дэлгэрэнгүй
ru_ru: Сведения о токене
zh_cn: 令牌详情

# Token_Back
source: Back to Settings
ar_sa: العودة إلى الإعدادات
es_es: Volver a Ajustes
fr_fr: Retour aux paramètres
mn_mn: Settings руу буцах
ru_ru: Назад к настройкам
zh_cn: 返回设置

# Token_Field_Backend
source: Backend
ar_sa: الواجهة الخلفية
mn_mn: Бэкенд
ru_ru: Провайдер
zh_cn: 后端

# Token_Field_Serial
source: Serial
ar_sa: الرقم التسلسلي
es_es: Número de serie
fr_fr: Numéro de série
mn_mn: Серийн дугаар
ru_ru: Серийный номер
zh_cn: 序列号

# Token_Section_Pin
source: PIN unlock
ar_sa: فتح القفل برمز PIN
es_es: Desbloqueo con PIN
fr_fr: Déverrouillage par PIN
mn_mn: PIN баталгаажуулалт
ru_ru: Разблокировка PIN
zh_cn: PIN 解锁

# Token_Pin_Placeholder
source: User PIN
ar_sa: رمز PIN للمستخدم
es_es: PIN de usuario
fr_fr: PIN utilisateur
ru_ru: PIN пользователя
zh_cn: 用户 PIN

# Token_Unlock
source: Unlock
ar_sa: فتح القفل
es_es: Desbloquear
fr_fr: Déverrouiller
mn_mn: Нээх
ru_ru: Разблокировать
zh_cn: 解锁

# Token_Section_Objects
source: Token objects
ar_sa: عناصر المفتاح
es_es: Objetos del token
fr_fr: Objets du token
mn_mn: Токены доторх объектууд
ru_ru: Объекты токена
zh_cn: 令牌对象

# Token_Loading_Objects
source: Loading objects...
ar_sa: جارٍ تحميل العناصر…
es_es: Cargando objetos…
fr_fr: Chargement des objets…
mn_mn: Объект уншиж байна...
ru_ru: Загрузка объектов...
zh_cn: 正在加载对象...

# Token_Empty_Objects
source: No objects found on this token.
ar_sa: لا توجد عناصر على هذا المفتاح.
es_es: No se encontraron objetos en este token.
fr_fr: Aucun objet trouvé sur ce token.
mn_mn: Токен дотор объект олдсонгүй.
ru_ru: На этом токене объекты не найдены.
zh_cn: 该令牌上未找到任何对象。

# Token_Section_SignTest
source: Sign test
ar_sa: اختبار التوقيع
es_es: Prueba de firma
fr_fr: Test de signature
mn_mn: Гарын үсэг туршилт
ru_ru: Тест подписи
zh_cn: 签名测试

# Token_SignTest_Data
source: Data to sign
ar_sa: البيانات المراد توقيعها
es_es: Datos que firmar
fr_fr: Données à signer
mn_mn: Гарын үсэг зурах текст
ru_ru: Данные для подписи
zh_cn: 待签名数据

# Token_SignTest_Run
source: Sign
ar_sa: توقيع
es_es: Firmar
fr_fr: Signer
mn_mn: Гарын үсэг зурах
ru_ru: Подписать
zh_cn: 签名

# Token_SignTest_Result
source: Signature (hex)
ar_sa: التوقيع (hex)
es_es: Firma (hex)
mn_mn: Гарын үсэг (hex)
ru_ru: Подпись (hex)
zh_cn: 签名（十六进制）

# Token_ReadCert
source: Read certificate
ar_sa: قراءة الشهادة
es_es: Leer el certificado
fr_fr: Lire le certificat
mn_mn: Гэрчилгээ татах
ru_ru: Прочитать сертификат
zh_cn: 读取证书

# Token_Hint_Cng
source: Windows shows the PIN dialog automatically. Click Sign below to test the key.
ar_sa: يعرض Windows نافذة PIN تلقائياً. اضغط توقيع أدناه لاختبار المفتاح.
es_es: Windows muestra el diálogo de PIN automáticamente. Pulse Firmar abajo para probar la clave.
fr_fr: Windows affiche automatiquement la fenêtre de PIN. Cliquez sur Signer ci-dessous pour tester la clé.
mn_mn: Windows өөрөө PIN дэлгэц гаргана. Доорх Sign товчийг даран түлхүүрт хандаж туршина уу.
ru_ru: Windows покажет диалог PIN автоматически. Нажмите «Подписать» ниже, чтобы проверить ключ.
zh_cn: Windows 会自动弹出 PIN 对话框。点击下方“签名”以测试密钥。

# Token_Section_Enroll
source: Setup for login (issue cert via CA)
ar_sa: الإعداد لتسجيل الدخول (إصدار شهادة عبر CA)
es_es: Configuración para el inicio de sesión (emitir certificado en la AC)
fr_fr: Configuration pour la connexion (délivrance d'un certificat par l'AC)
mn_mn: Нэвтрэлтийн setup (CA-аар гэрчилгээ авах)
ru_ru: Настройка для входа (выпуск сертификата через CA)
zh_cn: 登录配置（通过 CA 签发证书）

# Token_Enroll_Hint
source: Use this token's key to build a CSR and request a citizen-bound cert from the e-ID Mongolia Issuing CA. After enrollment, this token can be used to sign in directly. REQUIREMENT: You must already be signed in via QR or national ID before enrolling.
ar_sa: استخدم مفتاح هذا الرمز لإنشاء CSR وطلب شهادة مرتبطة بالمواطن من سلطة الإصدار e-ID Mongolia. بعد التسجيل يمكن استخدام هذا المفتاح لتسجيل الدخول مباشرةً. شرط: يجب أن تكون قد سجّلت الدخول عبر QR أو الرقم الوطني قبل التسجيل.
es_es: Use la clave de este token para crear una CSR y solicitar un certificado vinculado al ciudadano a la AC emisora de e-ID Mongolia. Tras la emisión, este token permitirá iniciar sesión directamente. REQUISITO: debe haber iniciado sesión con QR o documento nacional antes de emitirlo.
fr_fr: Utilisez la clé de ce token pour créer une CSR et demander un certificat lié au citoyen auprès de l'AC émettrice e-ID Mongolia. Après l'enrôlement, ce token permettra de se connecter directement. PRÉREQUIS : vous devez déjà être connecté par QR ou numéro national avant l'enrôlement.
mn_mn: Энэ токений түлхүүрээр CSR үүсгээд, e-ID Mongolia Issuing CA-аар иргэний нэртэй холбосон гэрчилгээ авна. Үүний дараа уг токеноор шууд нэвтэрч болно. ШААРДЛАГАТАЙ: Эхлээд QR/Регистрийн дугаар-аар нэвтэрсэн байх ёстой.
ru_ru: Использовать ключ этого токена для формирования CSR и запроса сертификата, привязанного к гражданину, в удостоверяющем центре e-ID Mongolia. После выпуска этим токеном можно входить напрямую. ТРЕБОВАНИЕ: перед выпуском вы должны быть уже авторизованы по QR или регистрационному номеру.
zh_cn: 使用该令牌上的密钥生成 CSR，并向 e-ID Mongolia 签发 CA 申请与公民绑定的证书。签发完成后，即可直接使用该令牌登录。前提条件：在签发之前，您必须已通过二维码或登记号完成登录。

# Token_Enroll_Run
source: Enroll this token with the CA
ar_sa: تسجيل هذا المفتاح لدى الـ CA
es_es: Emitir certificado para este token en la AC
fr_fr: Enrôler ce token auprès de l'AC
mn_mn: Токеноо CA-аар бүртгүүлэх
ru_ru: Выпустить сертификат для этого токена
zh_cn: 为该令牌向 CA 申请证书

# Token_Enroll_Status_BuildingCsr
source: Building CSR... (PIN dialog may appear)
ar_sa: جارٍ إنشاء CSR… (قد تظهر نافذة PIN)
es_es: Creando la CSR… (puede aparecer el diálogo de PIN)
fr_fr: Création de la CSR… (une fenêtre de PIN peut apparaître)
mn_mn: CSR үүсгэж байна... (PIN dialog гарч магадгүй)
ru_ru: Формирование CSR... (может появиться диалог PIN)
zh_cn: 正在生成 CSR...（可能弹出 PIN 对话框）

# Token_Enroll_Status_Submitting
source: Submitting CSR to server...
ar_sa: جارٍ إرسال CSR إلى الخادم…
es_es: Enviando la CSR al servidor…
fr_fr: Envoi de la CSR au serveur…
mn_mn: CSR-ийг сервер рүү илгээж байна...
ru_ru: Отправка CSR на сервер...
zh_cn: 正在向服务器提交 CSR...

# Token_Enroll_Status_Installing
source: Installing cert into the Windows store...
ar_sa: جارٍ تثبيت الشهادة في مخزن Windows…
es_es: Instalando el certificado en el almacén de Windows…
fr_fr: Installation du certificat dans le magasin Windows…
mn_mn: Гэрчилгээг Windows store-д суулгаж байна...
ru_ru: Установка сертификата в хранилище Windows...
zh_cn: 正在将证书安装到 Windows 存储...

# Token_Enroll_Status_Done
source: ✅ Token enrolled. You can now use the USB Token tab to sign in.
ar_sa: ✅ تم تسجيل المفتاح. يمكنك الآن تسجيل الدخول من تبويب مفتاح USB.
es_es: ✅ Token emitido. Ya puede iniciar sesión desde la pestaña Token USB.
fr_fr: ✅ Token enrôlé. Vous pouvez désormais vous connecter via l'onglet Token USB.
mn_mn: ✅ Токен амжилттай бүртгэгдсэн. USB Token tab-аар нэвтэрч болно.
ru_ru: ✅ Токен выпущен. Теперь можно входить через вкладку «USB-токен».
zh_cn: ✅ 令牌已完成签发。现在可使用“USB 令牌”选项卡登录。

# Token_Enroll_Error_NotLoggedIn
source: You must be signed in (QR or National ID) before enrolling a token.
ar_sa: يجب تسجيل الدخول (QR أو الرقم الوطني) قبل تسجيل المفتاح.
es_es: Debe iniciar sesión (QR o documento nacional) antes de emitir un token.
fr_fr: Vous devez être connecté (QR ou numéro national) avant d'enrôler un token.
mn_mn: Setup хийхийн өмнө QR эсвэл регистрийн дугаараар нэвтэрсэн байх шаардлагатай.
ru_ru: Перед выпуском токена необходимо войти (по QR или регистрационному номеру).
zh_cn: 在为令牌签发证书之前，您必须先登录（二维码或登记号）。

# Token_Enroll_Error_NoKey
source: No signing key found on this token.
ar_sa: لم يُعثر على مفتاح توقيع على هذا المفتاح.
es_es: No se encontró clave de firma en este token.
fr_fr: Aucune clé de signature trouvée sur ce token.
mn_mn: Энэ токен дээр гарын үсэг зурах түлхүүр олдсонгүй.
ru_ru: На этом токене не найден ключ подписи.
zh_cn: 该令牌上未找到签名密钥。

# Token_Enroll_Error_BadPem
source: Server returned an unparseable cert PEM.
ar_sa: أعاد الخادم شهادة PEM غير قابلة للتحليل.
es_es: El servidor devolvió un PEM de certificado ilegible.
fr_fr: Le serveur a renvoyé un PEM de certificat illisible.
mn_mn: Сервер буцаасан PEM unbroken/буруу.
ru_ru: Сервер вернул сертификат PEM, который не удалось разобрать.
zh_cn: 服务器返回的证书 PEM 无法解析。

# Token_Status_Enrolled
source: Token fully enrolled
ar_sa: المفتاح مسجَّل بالكامل
es_es: Token totalmente emitido
fr_fr: Token entièrement enrôlé
mn_mn: Токен бүрэн setup хийгдсэн
ru_ru: Токен полностью настроен
zh_cn: 令牌已完成签发

# Token_State_Blank
source: Blank — first-time setup required
ar_sa: فارغ — يلزم الإعداد الأولي
es_es: En blanco: se requiere configuración inicial
fr_fr: Vierge — configuration initiale requise
mn_mn: Хоосон — анхны тохиргоо хэрэгтэй
ru_ru: Пустой — требуется первичная настройка
zh_cn: 空白 —— 需要首次初始化

# Token_State_Initialized
source: SO PIN set — set the user PIN next
ar_sa: تم ضبط رمز SO — اضبط رمز المستخدم تالياً
es_es: PIN de SO configurado: ahora defina el PIN de usuario
fr_fr: PIN SO défini — définissez maintenant le PIN utilisateur
mn_mn: SO PIN тохируулсан — хэрэглэгчийн PIN тохируулна уу
ru_ru: SO PIN задан — далее задайте PIN пользователя
zh_cn: 已设置 SO PIN —— 接下来请设置用户 PIN

# Token_State_Provisioned
source: Provisioned — enroll with the CA
ar_sa: مُهيَّأ — سجّله لدى الـ CA
es_es: Aprovisionado: emita el certificado en la AC
fr_fr: Provisionné — à enrôler auprès de l'AC
mn_mn: Бэлэн — CA-аар бүртгүүлэх ёстой
ru_ru: Настроен — выпустите сертификат в CA
zh_cn: 已配置 —— 请向 CA 申请证书

# Token_State_Enrolled
source: Enrolled — ready to sign in
ar_sa: مسجَّل — جاهز لتسجيل الدخول
es_es: Emitido: listo para iniciar sesión
fr_fr: Enrôlé — prêt pour la connexion
mn_mn: Бүртгэгдсэн — нэвтрэх боломжтой
ru_ru: Сертификат выпущен — можно входить
zh_cn: 已签发 —— 可用于登录

# Token_State_Unknown
source: Unknown state
ar_sa: حالة غير معروفة
es_es: Estado desconocido
fr_fr: État inconnu
mn_mn: Танигдаагүй төлөв
ru_ru: Состояние неизвестно
zh_cn: 状态未知

# Token_Cap_UserPinSet
source: User PIN ✓
ar_sa: رمز المستخدم ✓
es_es: PIN de usuario ✓
fr_fr: PIN utilisateur ✓
mn_mn: Хэрэглэгчийн PIN ✓
ru_ru: PIN пользователя ✓
zh_cn: 用户 PIN ✓

# Token_Cap_UserPinUnset
source: User PIN ✗
ar_sa: رمز المستخدم ✗
es_es: PIN de usuario ✗
fr_fr: PIN utilisateur ✗
mn_mn: Хэрэглэгчийн PIN ✗
ru_ru: PIN пользователя ✗
zh_cn: 用户 PIN ✗

# Token_Cap_Biometric
source: Fingerprint sensor
ar_sa: مستشعر البصمة
es_es: Sensor de huella
fr_fr: Capteur d'empreinte
mn_mn: Хурууны хээ уншигчтай
ru_ru: Сканер отпечатка пальца
zh_cn: 指纹传感器

# Token_Cap_ProtectedAuth
source: Protected PIN entry
ar_sa: إدخال PIN محمي
es_es: Introducción de PIN protegida
fr_fr: Saisie de PIN protégée
mn_mn: Хамгаалагдсан PIN оролт
ru_ru: Защищённый ввод PIN
zh_cn: 受保护的 PIN 输入

# Token_Pin_StatusLow
source: ⚠ PIN — few tries left
ar_sa: ⚠ PIN — محاولات قليلة متبقية
es_es: ⚠ PIN: quedan pocos intentos
fr_fr: ⚠ PIN — peu d'essais restants
mn_mn: ⚠ PIN — оролдлого цөөн үлдсэн
ru_ru: ⚠ PIN — осталось мало попыток
zh_cn: ⚠ PIN —— 剩余尝试次数不多

# Token_Pin_StatusFinalTry
source: ⚠ PIN — final try remaining
ar_sa: ⚠ PIN — المحاولة الأخيرة
es_es: ⚠ PIN: último intento
fr_fr: ⚠ PIN — dernier essai
mn_mn: ⚠ PIN — сүүлийн нэг оролдлого үлдсэн
ru_ru: ⚠ PIN — осталась последняя попытка
zh_cn: ⚠ PIN —— 仅剩最后一次尝试

# Token_Pin_StatusLocked
source: 🔒 PIN locked
ar_sa: 🔒 رمز PIN مقفل
es_es: 🔒 PIN bloqueado
fr_fr: 🔒 PIN verrouillé
mn_mn: 🔒 PIN түгжигдсэн
ru_ru: 🔒 PIN заблокирован
zh_cn: 🔒 PIN 已锁定
